*******(19101579_FarnazFawadHasan_8)*******

Connecting Router1 to PC1:

~~~~~~~~~~Task 2~~~~~~~~~~~

Step 2: Enter privileged EXEC mode.
Router>enable
Router#

Step 3: Clear the configuration.
Router#erase startup-config
Erasing the nvram filesystem will remove all files! Continue? [confirm]
[OK]
Erase of nvram: complete
Router#

Step 4: Reload configuration
Router#reload
System configuration has been modified. Save? [yes/no]: no
Proceed with reload? [confirm]
Would you like to enter the initial configuration dialog? [yes/no]: no
Would you like to terminate autoinstall? [yes]: [Press Return]
Press Enter to accept default.
Press RETURN to get started!



Step 5:
Router>enable
Router#

Router#erase startup-config
Erasing the nvram filesystem will remove all files! Continue? [confirm]
[OK]
Erase of nvram: complete
Router#

Router#reload
System configuration has been modified. Save? [yes/no]: no
Proceed with reload? [confirm]
Would you like to enter the initial configuration dialog? [yes/no]: no
Would you like to terminate autoinstall? [yes]: [Press Return]
Press Enter to accept default.
Press RETURN to get started!

~~~~~~TASK 3~~~~~~~~

Step 2: Enter privileged EXEC mode.
Router>enable
Router#

Step 3: Enter global configuration mode.
Router#configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#

Step 4: Configure the router name as R1.
Router(config)#hostname R1
R1(config)#

Step 5: Disable DNS lookup.
R1(config)#no ip domain-lookup
R1(config)# 

Step 6: Configure the EXEC mode password.
R1(config)#enable secret class
R1(config)#

Step 7: Configure a message-of-the-day banner.
R1(config)#banner motd &
Enter TEXT message. End with the character '&'.
********************************
 !!!AUTHORIZED ACCESS ONLY!!!
********************************
&
R1(config)# 

Step 8: Configure the console password on the router.
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#

Step 9: Configure the password for the virtual terminal lines.
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#

Step 10: Configure the FastEthernet0/0 interface.
R1(config)#interface fastethernet 0/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed
state to up
R1(config-if)#

Step 11: Configure the Serial0/0/0 interface.
R1(config-if)#interface serial 0/0/0
R1(config-if)#ip address 192.168.2.1 255.255.255.0
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)# 


Step 12: Return to privileged EXEC mode.
R1(config-if)#end
R1#

Step 13: Save the R1 configuration.
R1#copy running-config startup-config
Building configuration...
[OK]
R1#


------------------------------------------------------------------------
Connecting Router2 to PC2:


~~~~~~TASK 4~~~~~~~~
Step 1:

Step 1.2: Enter privileged EXEC mode.
Router>enable
Router#

Step 1.3: Enter global configuration mode.
Router#configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#

Step 1.4: Configure the router name as R2.
Router(config)#hostname R2
R2(config)#

Step 1.5: Disable DNS lookup.
R2(config)#no ip domain-lookup
R2(config)# 

Step 1.6: Configure the EXEC mode password.
R2(config)#enable secret class
R2(config)#

Step 1.7: Configure a message-of-the-day banner.
R2(config)#banner motd &
Enter TEXT message. End with the character '&'.
********************************
 !!!AUTHORIZED ACCESS ONLY!!!
********************************
&
R2(config)# 

Step 1.8: Configure the console password on the router.
R2(config)#line console 0
R2(config-line)#password cisco
R2(config-line)#login
R2(config-line)#exit
R2(config)#

Step 1.9: Configure the password for the virtual terminal lines.
R2(config)#line vty 0 4
R2(config-line)#password cisco
R2(config-line)#login
R2(config-line)#exit
R2(config)#

Step 1.1.10: Configure the FastEthernet0/0 interface.
R2(config)#interface fastethernet 0/0
R2(config-if)#ip address 192.168.1.1 255.255.255.0
R2(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed
state to up
R2(config-if)#

Step 1.1.11: Configure the Serial0/0/0 interface.
R2(config-if)#interface serial 0/0/0
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#clock rate 64000
R2(config-if)#no shutdown
R2(config-if)# 


Step 1.1.12: Return to privileged EXEC mode.
R2(config-if)#end
R2#

Step 1.1.13: Save the R2 configuration.
R2#copy running-config startup-config
Building configuration...
[OK]
R2#


Step 2: Configure the Serial 0/0/0 interface.
R2(config)#interface serial 0/0/0
R2(config-if)#ip address 192.168.2.2 255.255.255.0
R2(config-if)#no shutdown
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state
to up
R2(config-if)# 

Step 3: Configure the FastEthernet0/0 interface.
Configure the FastEthernet0/0 interface with the IP address 192.168.3.1/24.
R2(config-if)#interface fastethernet 0/0
R2(config-if)#ip address 192.168.3.1 255.255.255.0
R2(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed
state to up
R2(config-if)#

Step 4: Return to privileged EXEC mode.
Use the end command to return to privileged EXEC mode.
R2(config-if)#end
R2#

Step 5: Save the R2 configuration.
Save the R2 configuration using the copy running-config startup-config command.
R2#copy running-config startup-config
Building configuration...
[OK]
R2#

~~~~~~~~~~~Task 5~~~~~~~~~~

Step 1: Configure the host PC1. 	
PC1 IP Configuration
IPv4 Address : 192.168.1.10
Subnet Mask : 255.255.255.0
Default Gateway: 192.168.1.1
DNS Server : 0.0.0.0	

Step 2: Configure the host PC2. 
PC2 IP Configuration
IPv4 Address : 192.168.3.10
Subnet Mask : 255.255.255.0
Default Gateway: 192.168.3.1
DNS Server : 0.0.0.0


~~~~~~~~~~~Task 6~~~~~~~~~~
Step 1: Verify that routing tables have the following routes using the show ip route command.
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
 D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
 N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
 E1 - OSPF external type 1, E2 - OSPF external type 2
 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
 ia - IS-IS inter area, * - candidate default, U - per-user static route
 o - ODR, P - periodic downloaded static route
Gateway of last resort is not set
C 192.168.1.0/24 is directly connected, FastEthernet0/0
C 192.168.2.0/24 is directly connected, Serial0/0/0
------------------------
R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
 D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
 N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
 E1 - OSPF external type 1, E2 - OSPF external type 2
 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
 ia - IS-IS inter area, * - candidate default, U - per-user static route
 o - ODR, P - periodic downloaded static route
Gateway of last resort is not set
C 192.168.2.0/24 is directly connected, Serial0/0/0
C 192.168.3.0/24 is directly connected, FastEthernet0/0

Step 2: Verify interface configurations. 
R1#show ip interface brief
Interface IP-Address OK? Method Status Protocol
FastEthernet0/0 192.168.1.1 YES manual up up
FastEthernet0/1 unassigned YES unset administratively down down
Serial0/0/0 192.168.2.1 YES manual up up
Serial0/0/1 unassigned YES unset administratively down down
Vlan1 unassigned YES manual administratively down down

R2#show ip interface brief
Interface IP-Address OK? Method Status Protocol
FastEthernet0/0 192.168.3.1 YES manual up up
FastEthernet0/1 unassigned YES unset administratively down down
Serial0/0/0 192.168.2.2 YES manual up up
Serial0/0/1 unassigned YES unset down down
Vlan1 unassigned YES manual administratively down down

Step 3: Test connectivity. 

Step 4: Test connectivity between router R1 and R2.

~~~~~~~~~~Task 7: Reflection~~~~~~~~~~~

Step 1: Attempt to ping from the host connected to R1 to the host connected to R2.
This ping should be unsuccessful.
Step 2: Attempt to ping from the host connected to R1 to router R2.
This ping should be unsuccessful.
Step 3: Attempt to ping from the host connected to R2 to router R1.
This ping should be unsuccessful. 


